MatthiasRus/Embedded-STM32/MCU1/STM32L4xx_drivers/Src/BTN_interrupt.c
#include "stm32l476xx.h"
#include <string.h>

#define LOW 			0
#define HIGH			1
#define BTN_PRESSED 	LOW

void delay(void){
	for (int i = 0; i<500000/2; i++);
}
int main(void)
{
    GPIO_Handle_t GpioLed,GpioButton;
//
    memset(&GpioLed,0,sizeof(GpioLed));
    memset(&GpioButton, 0, sizeof(GpioButton));

    GpioButton.pGPIOx = GPIOC;		// Button
    GpioLed.pGPIOx = GPIOA;			// LED

    // GPIO LED Definition
    GpioLed.GPIO_PIN_Config.GPIO_PinNumber = GPIO_PIN_5;
    GpioLed.GPIO_PIN_Config.GPIO_PinMode = GPIO_MODE_OUT;
    GpioLed.GPIO_PIN_Config.GPIO_PinSpeed = GPIO_SP_HIGH;
    GpioLed.GPIO_PIN_Config.GPIO_OPType = GPIO_OP_TYPE_PP;
    GpioLed.GPIO_PIN_Config.GPIO_PinPuPdControl = GPIO_NO_PUPD;

    // Clock Enable Disable Control
    GPIO_Periph_ClockControl(GPIOA, ENABLE);

    GPIO_Init(&GpioLed);


    // GPIO Button Definition
    GpioButton.GPIO_PIN_Config.GPIO_PinNumber = GPIO_PIN_13;
    GpioButton.GPIO_PIN_Config.GPIO_PinMode = GPIO_MODE_IT_FT;	// Falling Edge Interrupt
    GpioButton.GPIO_PIN_Config.GPIO_PinSpeed = GPIO_SP_HIGH;
    GpioButton.GPIO_PIN_Config.GPIO_PinPuPdControl = GPIO_PIN_PU;   // pull up is available on the board itself

    // Clock Enable Disable Control
    GPIO_Periph_ClockControl(GPIOC, ENABLE);

    GPIO_Init(&GpioButton);

    // IRQ Configuration

    GPIO_IRQPriority_Config(IRQ_NO_EXTI15_10, NVIC_IRQ_PRI15);
    GPIO_IRQInterrupt_Config(IRQ_NO_EXTI15_10, ENABLE);

	while(1);
}

void EXTI15_10_IRQHandler(void){
//		delay();
    	GPIO_IRQHandler(GPIO_PIN_13);
    	GPIO_ToggleOutputPin(GPIOA, GPIO_PIN_5);
    }
